it looks like the apigee tests are failing because it's unable to update the billing type to null

```
          # google_apigee_organization.apigee_org must be replaced
        -/+ resource "google_apigee_organization" "apigee_org" {
              - billing_type       = "EVALUATION" -> null
              ~ ca_certificate     = "" -> (known after apply)
              ~ id                 = "organizations/tf-testnz49of6h07" -> (known after apply)
              ~ name               = "tf-testnz49of6h07" -> (known after apply)
              ~ subscription_type  = "TRIAL" -> (known after apply)
                # (4 unchanged attributes hidden)
            }
```